Catalogs/StructuralUnits.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>StructuralUnits</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StructuralUnitType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StructuralUnitsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderWarehouse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FRP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailPriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccountInRetail</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MarkupGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransferSource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransferSourceCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransferRecipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransferRecipientCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RecipientOfWastes</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DisposalsRecipientCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOffToExpensesSource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOffToExpensesSourceCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOffToExpensesRecipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOffToExpensesRecipientCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PassToOperationSource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PassToOperationSourceCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PassToOperationRecipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PassToOperationRecipientCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnFromOperationSource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnFromOperationSourceCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnFromOperationRecipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnFromOperationRecipientCell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldsValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail_Address</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberNoCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/StructuralUnitsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>StructuralUnitsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Division</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warehouse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailAccrualAccounting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/StructuralUnits/Forms/ListForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURES AND FUNCTIONS OF SAVING SETTINGS

&AtServer
// Procedure saves the selected item in settings.
//
Procedure SetMainItem(SelectedItem, SettingName)
	
	If SettingName = "MainWarehouse" 
	   AND SelectedItem.StructuralUnitType = Enums.StructuralUnitsTypes.Division Then
		Message = New UserMessage();
		Message.Text = NStr("en='You can not choose division as the main warehouse!';ru='В качестве основного склада нельзя выбирать Подразделение!'");
		Message.Message();
		Return;
	EndIf;
	If SettingName = "MainDivision"
	   AND SelectedItem.StructuralUnitType <> Enums.StructuralUnitsTypes.Division Then
		Message = New UserMessage();
		Message.Text = NStr("en='You must choose division as main division!';ru='В качестве основного подразделения необходимо выбрать Подразделение!'");
		Message.Message();
		Return;
	EndIf; 
	If SelectedItem <> SmallBusinessReUse.GetValueOfSetting(SettingName) Then
		SmallBusinessServer.SetUserSetting(SelectedItem, SettingName);
		SmallBusinessServer.MarkMainItemWithBold(SelectedItem, List, SettingName);
	EndIf;
		
EndProcedure

&AtClient
// Procedure - command execution handler CommandSetMainDivision.
//
Procedure CommandSetMainDivision(Command)
	
	SelectedItem = Items.List.CurrentRow;
	If ValueIsFilled(SelectedItem) Then
		SetMainItem(SelectedItem, "MainDivision");
	EndIf;
	
EndProcedure

&AtClient
// Procedure - command execution handler CommandSetMainWarehouse.
//
Procedure CommandSetMainWarehouse(Command)
	
	SelectedItem = Items.List.CurrentRow;
	If ValueIsFilled(SelectedItem) Then
		SetMainItem(SelectedItem, "MainWarehouse");
	EndIf;
	
EndProcedure

&AtServer
// Function of checking the types hierarchy of structural units.
//
Function CheckTypeHierarchy()
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	StructuralUnits.Ref
	|FROM
	|	Catalog.StructuralUnits AS StructuralUnits
	|WHERE
	|	StructuralUnits.Parent <> VALUE(Catalog.StructuralUnits.EmptyRef)
	|	AND StructuralUnits.StructuralUnitType <> StructuralUnits.Parent.StructuralUnitType";
	
	Result = Query.Execute();
	If Result.IsEmpty() Then
		Return False;
	Else
		Return True;
	EndIf;
	
EndFunction // CheckTypeHierarchy()

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
// Procedure - OnCreateAtServer event handler.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Selection of main item
	If Parameters.Filter.Property("StructuralUnitType") Then
		
		ShowWarehouse = False;
		ShowDivision = False;
		If TypeOf(Parameters.Filter.StructuralUnitType) = Type("FixedArray") Then
			For Each ArrayElement IN Parameters.Filter.StructuralUnitType Do
				If ArrayElement = Enums.StructuralUnitsTypes.Division Then
					ShowDivision = True;
				Else
					ShowWarehouse = True;
				EndIf;
			EndDo;
		Else
			If Parameters.Filter.StructuralUnitType = Enums.StructuralUnitsTypes.Division Then
				ShowDivision = True;
			Else
				ShowWarehouse = True;
			EndIf;
		EndIf; 
		
		CommonUseClientServer.SetFormItemProperty(Items, "CommandSetMainDivision", "Visible", ShowDivision);
		CommonUseClientServer.SetFormItemProperty(Items, "CommandSetMainWarehouse", "Visible", ShowWarehouse);
		If Not ShowWarehouse Then
			
			CommonUseClientServer.SetFormItemProperty(Items, "OrderWarehouse", "Visible", False);
			
		EndIf;
		
	Else
		
		ShowWarehouse = True;
		ShowDivision = True;
		
	EndIf;
	
	SmallBusinessServer.MarkMainItemWithBold(SmallBusinessReUse.GetValueOfSetting("MainWarehouse"), List, "MainWarehouse");
	SmallBusinessServer.MarkMainItemWithBold(SmallBusinessReUse.GetValueOfSetting("MainDivision"), List, "MainDivision");
	
	If Not GetFunctionalOption("UseDataSynchronization") Then
		Items.Company.Visible = False;
	EndIf;
	
	TypesHierarchy = False;
	If Not (ShowWarehouse AND ShowDivision) Then
		TypesHierarchy = CheckTypeHierarchy();
	EndIf;
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisForm);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
EndProcedure // OnCreateAtServer()

&AtClient
// Procedure - OnOpen form event handler
//
Procedure OnOpen(Cancel)
	
	If TypesHierarchy Then
		Items.List.Representation = TableRepresentation.List;
	EndIf;
	
EndProcedure // OnOpen()


// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
